app/controllers/recurring_subscriptions_controller.rb

  def create
    plan_id = params[:plan_id]

    # Create or retrieve Stripe customer
    customer = if current_user.stripe_customer_id
                 Stripe::Customer.retrieve(current_user.stripe_customer_id)
               else
                 Stripe::Customer.create(email: current_user.email, source: params[:stripeToken])
               end

    # Save customer ID to user
    current_user.update(stripe_customer_id: customer.id) unless current_user.stripe_customer_id

    # Create subscription in Stripe
    subscription = Stripe::Subscription.create(
      customer: customer.id,
      items: [{ plan: plan_id }]
    )

    # Save subscription details to user
    current_user.update(
      stripe_subscription_id: subscription.id,
      plan_id: plan_id
    )
---
UPDATE "users" SET "updated_at" = $1, "stripe_customer_id" = $2 WHERE "users"."id" = $3  [["updated_at", "2024-10-31 06:46:10.027441"], ["stripe_customer_id", "cus_R88PXTU2ac3C6o"], ["id", 5]]
UPDATE "users" SET "updated_at" = $1, "stripe_subscription_id" = $2, "plan_id" = $3 WHERE "users"."id" = $4  [["updated_at", "2024-10-31 06:46:12.531116"], ["stripe_subscription_id", "sub_1QFs90GPGVHHfu7m2t83lrr0"], ["plan_id", "plan_R889VYF8ijdnBA"], ["id", 5]]