app/controllers/sessions_controller.rb

  def create
    user = User.find_for_authentication(email: params[:user][:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["email", "test4@example.com"], ["LIMIT", 1]]